espressif/esp-idf/components/soc/esp32s2beta/include/soc/rtc_cntl_struct.h
            uint32_t sck_dcap:            8;             /*SCK_DCAP*/
            uint32_t rtc_dbias_slp:       3;             /*RTC_DBIAS during sleep*/
            uint32_t rtc_dbias_wak:       3;             /*RTC_DBIAS during wakeup*/
            uint32_t rtc_dboost_force_pd: 1;             /*RTC_DBOOST force power down*/
            uint32_t rtc_dboost_force_pu: 1;             /*RTC_DBOOST force power up*/
            uint32_t rtculator_force_pd:  1;             /*RTC_REG force power down (for RTC_REG power down means decrease the voltage to 0.8v or lower )*/
            uint32_t rtculator_force_pu:  1;
        };
        uint32_t val;
    } rtc;
    union {
        struct {
            uint32_t fastmem_force_noiso:     1;         /*Fast RTC memory force no ISO*/
            uint32_t fastmem_force_iso:       1;         /*Fast RTC memory force ISO*/
            uint32_t slowmem_force_noiso:     1;         /*RTC memory force no ISO*/
            uint32_t slowmem_force_iso:       1;         /*RTC memory force ISO*/
            uint32_t rtc_force_iso:           1;         /*rtc_peri force ISO*/
            uint32_t rtc_force_noiso:         1;         /*rtc_peri force no ISO*/
            uint32_t fastmem_folw_cpu:        1;         /*1: Fast RTC memory PD following CPU  0: fast RTC memory PD following RTC state machine*/
            uint32_t fastmem_force_lpd:       1;         /*Fast RTC memory force PD*/
            uint32_t fastmem_force_lpu:       1;         /*Fast RTC memory force no PD*/
            uint32_t slowmem_folw_cpu:        1;         /*1: RTC memory  PD following CPU  0: RTC memory PD following RTC state machine*/
            uint32_t slowmem_force_lpd:       1;         /*RTC memory force PD*/
            uint32_t slowmem_force_lpu:       1;         /*RTC memory force no PD*/
            uint32_t fastmem_force_pd:        1;         /*Fast RTC memory force power down*/
            uint32_t fastmem_force_pu:        1;         /*Fast RTC memory force power up*/
            uint32_t fastmem_pd_en:           1;         /*enable power down fast RTC memory in sleep*/
            uint32_t slowmem_force_pd:        1;         /*RTC memory force power down*/
            uint32_t slowmem_force_pu:        1;         /*RTC memory force power up*/
            uint32_t slowmem_pd_en:           1;         /*enable power down RTC memory in sleep*/
            uint32_t rtc_force_pd:            1;         /*rtc_peri force power down*/
            uint32_t rtc_force_pu:            1;         /*rtc_peri force power up*/
            uint32_t rtc_pd_en:               1;         /*enable power down rtc_peri in sleep*/
            uint32_t rtc_pad_force_hold:      1;         /*rtc pad force hold*/
            uint32_t reserved22:             10;
        };
        uint32_t val;
    } rtc_pwc;
    union {
        struct {
            uint32_t reserved0:           3;
            uint32_t lslp_mem_force_pd:   1;             /*memories in digital core force PD in sleep*/
            uint32_t lslp_mem_force_pu:   1;             /*memories in digital core force no PD in sleep*/
            uint32_t rom0_force_pd:       1;             /*ROM force power down*/
            uint32_t rom0_force_pu:       1;             /*ROM force power up*/
            uint32_t inter_ram0_force_pd: 1;             /*internal SRAM 0 force power down*/
            uint32_t inter_ram0_force_pu: 1;             /*internal SRAM 0 force power up*/
            uint32_t inter_ram1_force_pd: 1;             /*internal SRAM 1 force power down*/
            uint32_t inter_ram1_force_pu: 1;             /*internal SRAM 1 force power up*/
            uint32_t inter_ram2_force_pd: 1;             /*internal SRAM 2 force power down*/
            uint32_t inter_ram2_force_pu: 1;             /*internal SRAM 2 force power up*/
            uint32_t inter_ram3_force_pd: 1;             /*internal SRAM 3 force power down*/
            uint32_t inter_ram3_force_pu: 1;             /*internal SRAM 3 force power up*/
            uint32_t inter_ram4_force_pd: 1;             /*internal SRAM 4 force power down*/
            uint32_t inter_ram4_force_pu: 1;             /*internal SRAM 4 force power up*/
            uint32_t wifi_force_pd:       1;             /*wifi force power down*/
            uint32_t wifi_force_pu:       1;             /*wifi force power up*/
            uint32_t dg_wrap_force_pd:    1;             /*digital core force power down*/
            uint32_t dg_wrap_force_pu:    1;             /*digital core force power up*/
            uint32_t dg_dcdc_force_pd:    1;             /*digital dcdc force power down*/
            uint32_t dg_dcdc_force_pu:    1;             /*digital dcdc force power up*/
            uint32_t dg_dcdc_pd_en:       1;             /*enable power down digital dcdc in sleep*/
            uint32_t rom0_pd_en:          1;             /*enable power down ROM in sleep*/
            uint32_t inter_ram0_pd_en:    1;             /*enable power down internal SRAM 0 in sleep*/
            uint32_t inter_ram1_pd_en:    1;             /*enable power down internal SRAM 1 in sleep*/
            uint32_t inter_ram2_pd_en:    1;             /*enable power down internal SRAM 2 in sleep*/
            uint32_t inter_ram3_pd_en:    1;             /*enable power down internal SRAM 3 in sleep*/
            uint32_t inter_ram4_pd_en:    1;             /*enable power down internal SRAM 4 in sleep*/
            uint32_t wifi_pd_en:          1;             /*enable power down wifi in sleep*/
            uint32_t dg_wrap_pd_en:       1;
        };
        uint32_t val;
    } dig_pwc;
    union {
        struct {
            uint32_t reserved0:              7;
            uint32_t dig_iso_force_off:      1;
            uint32_t dig_iso_force_on:       1;
            uint32_t dg_pad_autohold:        1;          /*read only register to indicate digital pad auto-hold status*/
            uint32_t clr_dg_pad_autohold:    1;          /*wtite only register to clear digital pad auto-hold*/
            uint32_t dg_pad_autohold_en:     1;          /*digital pad enable auto-hold*/
            uint32_t dg_pad_force_noiso:     1;          /*digital pad force no ISO*/
            uint32_t dg_pad_force_iso:       1;          /*digital pad force ISO*/
            uint32_t dg_pad_force_unhold:    1;          /*digital pad force un-hold*/
            uint32_t dg_pad_force_hold:      1;          /*digital pad force hold*/
            uint32_t rom0_force_iso:         1;          /*ROM force ISO*/
            uint32_t rom0_force_noiso:       1;          /*ROM force no ISO*/
            uint32_t inter_ram0_force_iso:   1;          /*internal SRAM 0 force ISO*/
            uint32_t inter_ram0_force_noiso: 1;          /*internal SRAM 0 force no ISO*/
            uint32_t inter_ram1_force_iso:   1;          /*internal SRAM 1 force ISO*/
            uint32_t inter_ram1_force_noiso: 1;          /*internal SRAM 1 force no ISO*/
            uint32_t inter_ram2_force_iso:   1;          /*internal SRAM 2 force ISO*/
            uint32_t inter_ram2_force_noiso: 1;          /*internal SRAM 2 force no ISO*/
            uint32_t inter_ram3_force_iso:   1;          /*internal SRAM 3 force ISO*/
            uint32_t inter_ram3_force_noiso: 1;          /*internal SRAM 3 force no ISO*/
            uint32_t inter_ram4_force_iso:   1;          /*internal SRAM 4 force ISO*/
            uint32_t inter_ram4_force_noiso: 1;          /*internal SRAM 4 force no ISO*/
            uint32_t wifi_force_iso:         1;          /*wifi force ISO*/
            uint32_t wifi_force_noiso:       1;          /*wifi force no ISO*/
            uint32_t dg_wrap_force_iso:      1;          /*digital core force ISO*/
            uint32_t dg_wrap_force_noiso:    1;
        };
        uint32_t val;
    } dig_iso;
    union {
        struct {
            uint32_t chip_reset_width:     8;            /*chip reset siginal pulse width*/
            uint32_t chip_reset_en:        1;            /*wdt reset whole chip enable*/
            uint32_t pause_in_slp:         1;            /*pause WDT in sleep*/
            uint32_t appcpu_reset_en:      1;            /*enable WDT reset APP CPU*/
            uint32_t procpu_reset_en:      1;            /*enable WDT reset PRO CPU*/
            uint32_t flashboot_mod_en:     1;            /*enable WDT in flash boot*/
            uint32_t sys_reset_length:     3;            /*system reset counter length*/
            uint32_t cpu_reset_length:     3;            /*CPU reset counter length*/
            uint32_t stg3:                 3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t stg2:                 3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t stg1:                 3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t stg0:                 3;            /*1: interrupt stage en  2: CPU reset stage en  3: system reset stage en  4: RTC reset stage en*/
            uint32_t en:                   1;
        };
        uint32_t val;
    } wdt_config0;
    uint32_t wdt_config1;                             /**/
    uint32_t wdt_config2;                             /**/
    uint32_t wdt_config3;                             /**/
    uint32_t wdt_config4;                             /**/
    union {
        struct {
            uint32_t reserved0:   31;
            uint32_t feed:         1;
        };
        uint32_t val;
    } wdt_feed;
    uint32_t wdt_wprotect;                            /**/
    union {
        struct {
            uint32_t swd_reset_flag:   1;                /*swd reset flag*/
            uint32_t swd_feed_int:     1;                /*swd interrupt for feeding*/
            uint32_t reserved2:       16;
            uint32_t swd_signal_width:10;                /*adjust signal width send to swd*/
            uint32_t swd_rst_flag_clr: 1;                /*reset swd reset flag*/
            uint32_t swd_feed:         1;                /*Sw feed swd*/
            uint32_t swd_disable:      1;                /*disabel SWD*/
            uint32_t swd_auto_feed_en: 1;                /*automatically feed swd when int comes*/
        };
        uint32_t val;
    } swd_conf;
    uint32_t swd_wprotect;                           /*swd write protect*/
    union {
        struct {
            uint32_t reserved0: 28;
            uint32_t ent_tsens:  1;                      /*ENT_TSENS*/
            uint32_t ent_rtc:    1;                      /*ENT_RTC*/
            uint32_t dtest_rtc:  2;
        };
        uint32_t val;
    } test_mux;
    union {
        struct {
            uint32_t reserved0:         20;
            uint32_t appcpu_c1:          6;              /*{reg_sw_stall_appcpu_c1[5:0]   reg_sw_stall_appcpu_c0[1:0]} == 0x86 will stall APP CPU*/
            uint32_t procpu_c1:          6;
        };
        uint32_t val;
    } sw_cpu_stall;
    uint32_t store4;                                 /**/
    uint32_t store5;                                 /**/
    uint32_t store6;                                 /**/
    uint32_t store7;                                 /**/
    union {
        struct {
            uint32_t xpd_rom0:                   1;      /*rom0 power down*/
            uint32_t reserved1:                  1;
            uint32_t xpd_dig_dcdc:               1;      /*External DCDC power down*/
            uint32_t rtc_peri_iso:               1;      /*rtc peripheral iso*/
            uint32_t xpd_rtc_peri:               1;      /*rtc peripheral power down*/
            uint32_t wifi_iso:                   1;      /*wifi iso*/
            uint32_t xpd_wifi:                   1;      /*wifi wrap power down*/
            uint32_t dig_iso:                    1;      /*digital wrap iso*/
            uint32_t xpd_dig:                    1;      /*digital wrap power down*/
            uint32_t rtc_touch_state_start:      1;      /*touch should start to work*/
            uint32_t rtc_touch_state_switch:     1;      /*touch is about to working. Switch rtc main state*/
            uint32_t rtc_touch_state_slp:        1;      /*touch is in sleep state*/
            uint32_t rtc_touch_state_done:       1;      /*touch is done*/
            uint32_t rtc_cocpu_state_start:      1;      /*ulp/cocpu should start to work*/
            uint32_t rtc_cocpu_state_switch:     1;      /*ulp/cocpu is about to working. Switch rtc main state*/
            uint32_t rtc_cocpu_state_slp:        1;      /*ulp/cocpu is in sleep state*/
            uint32_t rtc_cocpu_state_done:       1;      /*ulp/cocpu is done*/
            uint32_t rtc_main_state_xtal_iso:    1;      /*no use any more*/
            uint32_t rtc_main_state_pll_on:      1;      /*rtc main state machine is in states that pll should be running*/
            uint32_t rtc_rdy_for_wakeup:         1;      /*rtc is ready to receive wake up trigger from wake up source*/
            uint32_t rtc_main_state_wait_end:    1;      /*rtc main state machine has been waited for some cycles*/
            uint32_t rtc_in_wakeup_state:        1;      /*rtc main state machine is in the states of wakeup process*/
            uint32_t rtc_in_low_power_state:     1;      /*rtc main state machine is in the states of low power*/
            uint32_t rtc_main_state_in_wait_8m:  1;      /*rtc main state machine is in wait 8m state*/
            uint32_t rtc_main_state_in_wait_pll: 1;      /*rtc main state machine is in wait pll state*/
            uint32_t rtc_main_state_in_wait_xtl: 1;      /*rtc main state machine is in wait xtal state*/
            uint32_t rtc_main_state_in_slp:      1;      /*rtc main state machine is in sleep state*/
            uint32_t rtc_main_state_in_idle:     1;      /*rtc main state machine is in idle state*/
            uint32_t rtc_main_state:             4;      /*rtc main state machine status*/
        };
        uint32_t val;
    } low_power_st;
    uint32_t diag0;                                  /**/
    union {
        struct {
            uint32_t touch_pad0_hold:  1;
            uint32_t touch_pad1_hold:  1;
            uint32_t touch_pad2_hold:  1;
            uint32_t touch_pad3_hold:  1;
            uint32_t touch_pad4_hold:  1;
            uint32_t touch_pad5_hold:  1;
            uint32_t touch_pad6_hold:  1;
            uint32_t touch_pad7_hold:  1;
            uint32_t touch_pad8_hold:  1;
            uint32_t touch_pad9_hold:  1;
            uint32_t touch_pad10_hold: 1;
            uint32_t touch_pad11_hold: 1;
            uint32_t touch_pad12_hold: 1;
            uint32_t touch_pad13_hold: 1;
            uint32_t touch_pad14_hold: 1;
            uint32_t x32p_hold:        1;
            uint32_t x32n_hold:        1;
            uint32_t pdac1_hold:       1;
            uint32_t pdac2_hold:       1;
            uint32_t rtc_pad19_hold:   1;
            uint32_t rtc_pad20_hold:   1;
            uint32_t rtc_pad21_hold:   1;
            uint32_t reserved22:      10;
        };
        uint32_t val;
    } pad_hold;
    uint32_t dig_pad_hold;                               /**/
    union {
        struct {
            uint32_t sel:                   22;          /*Bitmap to select RTC pads for ext wakeup1*/
            uint32_t status_clr:             1;          /*clear ext wakeup1 status*/
            uint32_t reserved23:             9;
        };
        uint32_t val;
    } ext_wakeup1;
    union {
        struct {
            uint32_t status:            22;              /*ext wakeup1 status*/
            uint32_t reserved22:        10;
        };
        uint32_t val;
    } ext_wakeup1_status;
    union {
        struct {
            uint32_t reserved0:                 4;
            uint32_t int_wait:                 10;       /*brown out interrupt wait cycles*/
            uint32_t close_flash_ena:           1;       /*enable close flash when brown out happens*/
            uint32_t pd_rf_ena:                 1;       /*enable power down RF when brown out happens*/
            uint32_t rst_wait:                 10;       /*brown out reset wait cycles*/
            uint32_t rst_ena:                   1;       /*enable brown out reset*/
            uint32_t reserved27:                2;
            uint32_t cnt_clr:                   1;       /*clear brown out counter*/
            uint32_t ena:                       1;       /*enable brown out*/
            uint32_t det:                       1;
        };
        uint32_t val;
    } brown_out;
    uint32_t time_low1;                              /*RTC timer low 32 bits*/
    union {
        struct {
            uint32_t rtc_timer_value1_high:16;           /*RTC timer high 16 bits*/
            uint32_t reserved16:           16;
        };
        uint32_t val;
    } time_high1;
    uint32_t xtal32k_clk_factor;                     /*xtal 32k watch dog backup clock factor*/
    union {
        struct {
            uint32_t xtal32k_return_wait:  4;            /*cycles to wait to return noral xtal 32k*/
            uint32_t xtal32k_restart_wait:16;            /*cycles to wait to repower on xtal 32k*/
            uint32_t xtal32k_wdt_timeout:  8;            /*If no clock detected for this amount of time  32k is regarded as dead*/
            uint32_t xtal32k_stable_thres: 4;            /*if restarted xtal32k period is smaller than this  it is regarded as stable*/
        };
        uint32_t val;
    } xtal32k_conf;
    union {
        struct {
            uint32_t ulp_cp_pc_init:        11;          /*ULP-coprocessor PC initial address*/
            uint32_t reserved11:             1;
            uint32_t ulp_cp_timer_slp_cycle:16;          /*sleep cycles for ULP-coprocessor timer*/
            uint32_t reserved28:             1;
            uint32_t ulp_cp_gpio_wakeup_ena: 1;          /*ULP-coprocessor wakeup by GPIO enable*/
            uint32_t ulp_cp_gpio_wakeup_clr: 1;          /*ULP-coprocessor wakeup by GPIO state clear*/
            uint32_t ulp_cp_slp_timer_en:    1;          /*ULP-coprocessor timer enable bit*/
        };
        uint32_t val;
    } ulp_cp_timer;
    union {
        struct {
            uint32_t ulp_cp_mem_addr_init:  11;
            uint32_t ulp_cp_mem_addr_size:  11;
            uint32_t ulp_cp_mem_offst_clr:   1;
            uint32_t reserved23:             5;
            uint32_t ulp_cp_clk_fo:          1;          /*ulp coprocessor clk force on*/
            uint32_t ulp_cp_reset:           1;          /*ulp coprocessor clk software reset*/
            uint32_t ulp_cp_force_start_top: 1;          /*1: ULP-coprocessor is started by SW*/
            uint32_t ulp_cp_start_top:       1;          /*Write 1 to start ULP-coprocessor*/
        };
        uint32_t val;
    } ulp_cp_ctrl;
    union {
        struct {
            uint32_t cocpu_clk_fo:            1;         /*cocpu clk force on*/
            uint32_t cocpu_start_2_reset_dis: 6;         /*time from start cocpu to pull down reset*/
            uint32_t cocpu_start_2_intr_en:   6;         /*time from start cocpu to give start interrupt*/
            uint32_t cocpu_shut:              1;         /*to shut cocpu*/
            uint32_t cocpu_shut_2_clk_dis:    6;         /*time from shut cocpu to disable clk*/
            uint32_t cocpu_shut_reset_en:     1;         /*to reset cocpu*/
            uint32_t cocpu_sel:               1;         /*1: old ULP 0: new riscV*/
            uint32_t cocpu_done_force:        1;         /*1: select riscv done 0: select ulp done*/
            uint32_t cocpu_done:              1;         /*done signal used by riscv to control timer.*/
            uint32_t cocpu_sw_int_trigger:    1;         /*trigger cocpu register interrupt*/
            uint32_t reserved25:              7;
        };
        uint32_t val;
    } cocpu_ctrl;
    union {
        struct {
            uint32_t touch_sleep_cycles:16;              /*sleep cycles for timer*/
            uint32_t touch_meas_num:    16;              /*the meas length (in 8MHz)*/
        };
        uint32_t val;
    } touch_ctrl1;
    union {
        struct {
            uint32_t reserved0:          2;
            uint32_t touch_drange:       2;              /*TOUCH_DRANGE*/
            uint32_t touch_drefl:        2;              /*TOUCH_DREFL*/
            uint32_t touch_drefh:        2;              /*TOUCH_DREFH*/
            uint32_t touch_xpd_bias:     1;              /*TOUCH_XPD_BIAS*/
            uint32_t touch_refc:         3;              /*TOUCH pad0 reference cap*/
            uint32_t reserved12:         1;
            uint32_t touch_slp_timer_en: 1;              /*touch timer enable bit*/
            uint32_t touch_start_fsm_en: 1;              /*1: TOUCH_START & TOUCH_XPD is controlled by touch fsm*/
            uint32_t touch_start_en:     1;              /*1: start touch fsm*/
            uint32_t touch_start_force:  1;              /*1: to start touch fsm by SW*/
            uint32_t touch_xpd_wait:     8;              /*the waiting cycles (in 8MHz) between TOUCH_START and TOUCH_XPD*/
            uint32_t touch_slp_cyc_div:  2;              /*when a touch pad is active  sleep cycle could be divided by this number*/
            uint32_t reserved27:         2;
            uint32_t touch_reset:        1;              /*reset upgrade touch*/
            uint32_t touch_clk_fo:       1;              /*touch clock force on*/
            uint32_t touch_clkgate_en:   1;              /*touch clock enable*/
        };
        uint32_t val;
    } touch_ctrl2;
    union {
        struct {
            uint32_t touch_denoise_res:         2;       /*De-noise resolution: 12/10/8/4 bit*/
            uint32_t touch_denoise_en:          1;       /*touch pad0 will be used to de-noise*/
            uint32_t reserved3:                 5;
            uint32_t touch_inactive_connection: 1;       /*inactive touch pads connect to 1: gnd 0: HighZ*/
            uint32_t touch_shield_pad_en:       1;       /*touch pad14 will be used as shield*/
            uint32_t touch_scan_pad_map:       15;       /*touch scan mode pad enable map*/
            uint32_t touch_bufdrv:              3;       /*touch7 buffer driver strength*/
            uint32_t touch_out_ring:            4;       /*select out ring pad*/
        };
        uint32_t val;
    } touch_scan_ctrl;
    union {
        struct {
            uint32_t touch_slp_th:         22;           /*the threshold for sleep touch pad*/
            uint32_t reserved22:            4;
            uint32_t touch_slp_approach_en: 1;           /*sleep pad approach function enable*/
            uint32_t touch_slp_pad:         5;
        };
        uint32_t val;
    } touch_slp_thres;
    union {
        struct {
            uint32_t reserved0:               23;
            uint32_t touch_slp_channel_clr:    1;        /*clear touch slp channel*/
            uint32_t touch_approach_meas_time: 8;        /*approach pads total meas times*/
        };
        uint32_t val;
    } touch_approach;
    union {
        struct {
            uint32_t reserved0:            12;
            uint32_t touch_jitter_step:     4;           /*touch jitter step*/
            uint32_t config1:               4;
            uint32_t config2:               2;
            uint32_t touch_noise_thres:     2;
            uint32_t config3:               2;
            uint32_t touch_debounce:        3;           /*debounce counter*/
            uint32_t touch_filter_mode:     2;           /*0: IIR ? 1: IIR ? 2: IIR 1/8 3: Jitter*/
            uint32_t touch_filter_en:       1;           /*touch filter enable*/
        };
        uint32_t val;
    } touch_filter_ctrl;
    union {
        struct {
            uint32_t usb_vrefh:               2;
            uint32_t usb_vrefl:               2;
            uint32_t usb_vref_override:       1;
            uint32_t usb_pad_pull_override:   1;
            uint32_t usb_dp_pullup:           1;
            uint32_t usb_dp_pulldown:         1;
            uint32_t usb_dm_pullup:           1;
            uint32_t usb_dm_pulldown:         1;
            uint32_t usb_pullup_value:        1;
            uint32_t usb_pad_enable_override: 1;
            uint32_t usb_pad_enable:          1;
            uint32_t usb_txm:                 1;
            uint32_t usb_txp:                 1;
            uint32_t usb_tx_en:               1;
            uint32_t usb_tx_en_override:      1;
            uint32_t reserved17:             15;
        };
        uint32_t val;
    } usb_conf;
    union {
        struct {
            uint32_t date:      28;
            uint32_t reserved28: 4;
        };
        uint32_t val;
    } date;
} rtc_cntl_dev_t;
extern rtc_cntl_dev_t RTCCNTL;
#ifdef __cplusplus
}
#endif

#endif  /* _SOC_RTC_CNTL_STRUCT_H_ */
